backend/app/controllers/cart_items_controller.rb

    def show
        @cart_item = CartItem.find(params[:id])
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @cart_item = CartItem.create(cart_item_params)
---
INSERT INTO "cart_items" ("cart_id", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cart_id", 1], ["product_id", 1], ["created_at", "2020-03-03 15:55:23.109513"], ["updated_at", "2020-03-03 15:55:23.109513"]]

    def destroy
        @cart_item = CartItem.find(params[:id])
        @cart_item.destroy
        @cart_items = CartItem.all
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 1]]
SELECT "cart_items".* FROM "cart_items"